[
  {
    "stepNum": 1,
    "content": "Learn more about diabetes\nThere are three types of diabetes. Type 1 diabetes is a condition in which the body is not able to produce its own insulin. This means that it’s not able to convert sugar into energy. A person with Type 1 diabetes needs to take insulin every day. Type 2 diabetes is the most common. With this condition, the body makes its own insulin but in the wrong amounts. The risk of type 2 diabetes complications increases when blood glucose levels aren’t properly managed. Complications can include heart attack, stroke, nerve damage, kidney damage, and eye damage. The third type of diabetes is gestational diabetes. This occurs in women who are pregnant and often goes away once the woman has given birth."
  },
  {
    "stepNum": 2,
    "content": "Plan healthy meals for a diabetic\nA balanced diet can be very effective for weight loss, which is helpful when trying to keep blood sugar levels in check. While there is no specific diabetes diet, a good rule of thumb is to include vegetables, whole grains, fruit, low-fat dairy, healthy fats, and lean protein sources. Consult a dietitian to create a healthy meal plan, and encourage the person you’re caring for to stick to it. Try to serve meals and snacks at the same time every day. Include a source of fibre with each meal, as this can help lower spikes in glucose levels. Be sure to monitor blood glucose levels before meals, or as recommended by a doctor."
  },
  {
    "stepNum": 3,
    "content": "Get active\nEstablishing an exercise routine is an effective way to manage weight gain and control blood sugar levels, especially for a diabetic. Choose an activity that suits their level of fitness and personal interests, such as tennis, golf or hiking. Exercise doesn’t have to be too strenuous. Even walking just 30 minutes a day is enough to help improve glucose levels. Try to exercise at the same time every day. Bring along a snack in case their blood sugar level drops too low. And ensure they drink plenty of water or other sugar-free liquids to stay hydrated."
  },
  {
    "stepNum": 4,
    "content": "Monitor Medication\nIf diet and exercise aren’t enough to manage their glucose levels, a diabetic might be prescribed certain medication. Treatment usually begins with oral medication, and may be supplemented with other medication for related conditions such as cholesterol and high blood pressure. If oral medications aren’t effective, insulin injections may be required. If necessary, help the person you’re caring for administer their injections at the right times each day. It also helps to keep a written schedule to keep track."
  },
  {
    "stepNum": 5,
    "content": "Manage their moods\nWhen sugar levels are too high or too low, they can cause fluctuations in a diabetic person’s mood. Low blood glucose levels typically cause strong emotional responses such as anxiety, irritability or anger. High blood sugar levels often result in fatigue, low mood and irritability. Be aware of sudden mood changes, and check glucose levels to see whether they may be a result of low or high sugar levels."
  },
  {
    "stepNum": 6,
    "content": "Be aware of the diabetic body\nDiabetes can cause a number of complications to a diabetic’s physical wellbeing. People with diabetes are more likely to suffer from gum disease, fungus, and dry mouth. Make regular appointments at the dentist, and ensure that the person you’re caring for brushes and flosses twice a day. Foot care is also very important. Nerve damage in the feet can cause a diabetic to lose feeling and not notice any minor cuts or calluses. If unattended, these can lead to more serious problems. Do a daily foot examination to check for cuts, blisters, red spots or sores. Diabetics should never wear open-toe shoes or go barefoot, even around the house. Regular eye examinations are also recommended. And it goes without saying that smoking should be avoided."
  },
  {
    "stepNum": 7,
    "content": "Contact us for support and assisted living\nWe are fully equipped to provide the professional care, facilities and support diabetes patients' need to stay healthy and comfortable. Our residents are looked after by our national nursing services manager, nursing services manager, sisters, nurses and care workers. Residents also have access to a doctor, occupational therapist and support services. Our team will assess the needs of each resident to ensure they get the exact level of care they need. We have frail care facilities and retirement villages across South Africa. View our Our villages"
  }
]